// // 1) напиши переменную значение которой будет цифра. Выведи её в консоль.

 let a= 5;

console.log(a);  

// // 1) напиши переменную значение которой будет цифра. Выведи её в консоль.


// // 2) Запишите строку "Джон" в переменную name.

let name= 'Джон';
console.log(name); 

// // 2) Запишите строку "Джон" в переменную name.
 

// // 3) Создайте переменную num и присвойте ей значение 3.

let num= 3;
console.log(num); 

// // 3) Создайте переменную num и присвойте ей значение 3.

// // 4)Создайте переменные a=10 и b=2. Выведите в console.log() их сумму.

  a = 10;
  let b = 3;
  let sum = a + b;

  console.log(sum);


// 4)Создайте переменные a=10 и b=2. Выведите в console.log() их сумму.


// 5)Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c.

  a= 17;
  b= 10;
  let c= a - b;
  console.log(c);

// 5)Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c.

// 6)Создайте переменные str1='Привет, ' и str2='Мир!'. 
// С помощью этих переменных и операции сложения строк выведите в console.log() 'Привет, Мир!'.

  let str1='Привет,';
  let str2='Мир!';
  console.log(str1 + " " + str2) 

// 6)Создайте переменные str1='Привет, ' и str2='Мир!'. 
// С помощью этих переменных и операции сложения строк выведите в console.log() 'Привет, Мир!'.

// 7) Создайте переменную  c , дайте ей значение a + b  отобразите результат в console.log().

  a = 5;
  b = 10;
  c = a + b;
  console.log(c) 


// 7) Создайте переменную  c , дайте ей значение a + b  отобразите результат в console.log().


// 8) Напишите тип данных переменных

  let length = 16;          
  let lastName = "Johnson"; 

  console.log(typeof length);
  console.log(typeof lastName);

// 8) Напишите тип данных переменных